<template>
  <div>
    <panel>
      <div slot="title">{{$t('m.Frequently_Asked_Questions')}}</div>
      <div class="content markdown-body">
        <ul>
          <li>Как происходит ввод и вывод?
            <p>Ваша программа будет считывать исходные данные с консоли и выводить результирующие данные также в консоль.
              Например, вы можете использовать <code>scanf</code> в C или <code>cin</code> в C++ для получения исходных данных, и использовать <code>printf</code> в C или <code>cout</code> в C++ для вывода результирующих данных.
              Программам не разрешается считывать файлы или писать в них, иначе произойдёт ошибка выполнения.
            </p>
          </li>
          <li>Стандартный разделитель
            <p>Для всех языков данной системы стандартным разделителем в числа с плавающей точкой является точка. Например: 1.5, 6.87, 12.76.
            </p>
          </li>
          <li>Работа с вещественными числами
            <p> В случае, если в числе выходных данных будут присутствовать вещественные числа без дробной части, например 10.0, то следует выводить такие числа без разделителя и дробной части (25, а не 25.0).
            </p>
          </li>
          <li>Внешние ресурсы
            <p>В коде разрешается использовать только стандартные библиотеки. В противном случае произойдёт ошибка компиляции.
            </p>
          </li>
          <li>Что значит время выполнения решения?
            <p>Система может тестировать ваш код несколько раз с разными входными данными.
              Если ваша программа получит правильный ответ на всех тестах, показанное время выполнения - максимальное время среди всех проверенных тестов.
            </p>
          </li>
          <li>Как использовать Int64 в C++?
            <p>Вам нужно объявить <code>long long</code> и использовать его с <code>cin/cout</code> или <code>%lld</code>, использование<code> __int64</code> приведёт к ошибке компиляции.</p>
            <p>Не разрешается использование предварительно откомпилированных заголовков, например <code>stdafx.h</code></p>
          </li>
          <li>Особенности Java
            <p>Все программы должны быть описаны с помощью статического метода в классе <code>Main</code>. Не используйте public классы: даже <code>Main</code> должен быть не public для избежания ошибки компиляции. Также в конечном коде не должен присутствовать <code>package</code></p>
          </li>
          <li>Особенности C#
            <p>В случае, если ваш конечный код содержит <code>namespace</code> с именем неймспейса вашей программы, то его следует убрать, оставив только главный класс программы и используемые библиотеки.</p>
          </li>
        </ul>
      </div>
    </panel>
    <panel>
      <div slot="title">Объяснение результата</div>
      <div class="content markdown-body">
        <ul>
          <li><b>В ожидании</b> и <b>Оценивается</b> : {{$t('m.Pending_Juding')}}</li>
          <li><b>Ошибка компиляции</b> :	{{$t('m.Compile_Error')}}
          </li>
          <li><b>Принято</b> :	{{$t('m.Accepted')}}</li>
          <li><b>Неправильный ответ</b> :	{{$t('m.Wrong_Answer')}}</li>
          <li>
            <b>Ошибка исполнения</b>
            :	{{$t('m.Runtime_Error')}}
          </li>
          <li><b>Превышение лимита времени</b>
            :	{{$t('m.Time_Limit_Exceeded')}}
          </li>
          <li><b>Превышение лимита памяти</b> :	{{$t('m.Memory_Limit_Exceeded')}}</li>
          <li><b>Системная ошибка</b> :	{{$t('m.System_Error')}}
          </li>
        </ul>
      </div>
    </panel>
  </div>

</template>

<script>
  import utils from '@/utils/utils'

  export default {
    data () {
      return {
        languages: []
      }
    },
    beforeRouteEnter (to, from, next) {
      utils.getLanguages().then(languages => {
        next(vm => {
          vm.languages = languages
        })
      })
    }
  }
</script>

<style lang="less" scoped>
  .content {
    font-size: 16px;
    margin: 0 50px 40px 50px;
    > ul {
      list-style: disc;
      li {
        font-size: 16px;
        margin-top: 20px;
        &:first-child {
          margin-top: 0;
        }
        p {
          font-size: 14px;
          margin-top: 5px;
          word-break: break-word;
        }
      }
    }
  }
</style>
